package util

import "testing"

/**
* @Author: super
* @Date: 2020-09-24 19:54
* @Description:
**/

func TestEncodeMD5(t *testing.T) {
	var tests = []struct {
		in  string
		out string
	}{
		{"", "d41d8cd98f00b204e9800998ecf8427e"},
		{"hello", "5d41402abc4b2a76b9719d911017c592"},
		{"小肥猫告别了小瘦猫，去大城市闯荡了。“再见了，小瘦猫，我一只猫也能过得很好。”小肥猫抹下最后一颗泪珠，赌着气给小瘦猫写下了这封诀别信。小瘦猫还在熟睡着，连小肥猫用力关门的“咣当”声都没能把它吵醒。小肥猫一步三回头，却始终没有猫来追它回去。小肥猫叹口气，只能自己一个人去讨生活。她向来是胆小的，面对未知有诸多恐惧。恰逢大雨，航班居然延误十二个小时。坐在旁边的旅客兔小姐对同伴说：“按照我往常的经验，这趟航班应该被取消了”。小肥猫本来坚定下来的心又开始犹犹豫豫打起了鼓，要不要回去呢，可是回去就意味着自己的妥协。就在小肥猫犹豫不决的时候，小瘦猫突然出现了，没有责怪，也没有问小肥猫想离开它之后去哪里，小瘦猫只是把小肥猫拥抱在怀里。小肥猫退了票，像个跟屁虫一样，被小瘦猫牵回了家。小肥猫余气未消，走着走着她甩开手：每次你都是这样，一句多余的话都不说，连我要去哪里都不问吗？小瘦猫当然知道它想赌气离开自己，虽然不知道自己哪里做错了，可能在对待女朋友这里还是觉悟不够高吧。小瘦猫回答说：我不会问的。因为我会难过，无论你去到哪里，那个地方都没有我。", "80e99dc093cafed983ef6428a27ed645"},
	}

	for i, tt := range tests {
		s := EncodeMD5(tt.in)
		if s != tt.out {
			t.Errorf("%d. %q => %q, wanted: %q", i, tt.in, s, tt.out)
		}
	}
}
